Revit 2026 API
DockablePanes.BuiltInDockablePanes Class
 A collection of ids of the dockable panes provided by Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.DockablePanes.BuiltInDockablePanes
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static class BuiltInDockablePanes
Public NotInheritable Class BuiltInDockablePanes
public ref class BuiltInDockablePanes abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type BuiltInDockablePanes = class end
The DockablePanes.BuiltInDockablePanes type exposes the following members.
Properties
Name | Description
ContentDelivery |  The content delivery pane.
ElementView |  The element view pane.
FabricationPartBrowser |  The Fabrication part browser pane.
HostByLinkNavigator |  The host by link navigator pane.
PnIdModelerBrowser |  The P&ID modeler browser pane.
ProjectBrowser |  The project browser pane.
PropertiesPalette |  The properties palette pane.
RebarBrowser |  The rebar browser pane.
SharedViews |  The shared view pane.
SystemNavigator |  The system browser pane.
ViewBrowser |  The View browser pane.
Top
See Also
Reference
Autodesk.Revit.UI Namespace